Revit 2021.1 API
Document.Import Method
Overload List
Name | Description
Import(String, GBXMLImportOptions)
Imports a Green-Building XML file into the document.
Import(String, SATImportOptions, View)
 Imports an SAT file into the document.
Import(String, SKPImportOptions, View)
 Imports an SKP file into the document.
Import(String, DGNImportOptions, View, ElementId)
 Imports a DGN file to the document.
Import(String, DWGImportOptions, View, ElementId)
 Imports a DWG or DXF file to the document.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace